#include <stdio.h> 
#include <locale.h>
#include <math.h>

int main() {
    int x, y, z;
    float t;

    // введення значень змінних
    printf("Введіть значення x, y, z: ");
    scanf("%d %d %d", &x, &y, &z);

    // перевірка допустимості вхідних параметрів
    while (z == 2*y) {
        printf("Помилка: знаменник дорівнює нулю. Введіть нові значення x, y, z: ");
        scanf("%d %d %d", &x, &y, &z);
    }
    while (x < 0) {
        printf("Помилка: від'ємне значення під знаком кореня. Введіть нові значення x, y, z: ");
        scanf("%d %d %d", &x, &y, &z);
    }

    // обчислення значення функції
    t = sqrt(3*x/(z-2*y))*y*z + sin(x*x);

    // виведення результату
    printf("Значення функції t: %.2f\n", t);

    return 0;
}
