 #include <stdio.h>
#include <math.h>

double computeFunction(double x) //обчислюється значення функції f(x) = lg(x) / x. Перед обчисленням перевіряється, чи аргумент x не менше або дорівнює 0, щоб уникнути виникнення помилки при обчисленні логарифму або діленні на нуль.
{
    if (x <= 0) {
        // Перевірка на виняткові ситуації
        printf("Недопустиме значення аргумента: x <= 0\n");
        return 0;
    }

    return log10(x) / x;
}

int main() {
    double a = -1.0;
    double b = 3.0;
    double dx = 0.05;

    printf("Результати обчислення функції y = f(x) на проміжку [%.2f, %.2f] з кроком %.2f:\n", a, b, dx);
    printf("x\t\tf(x)\n");

    double x;
    for (x = a; x <= b; x += dx) //За допомогою циклу for обчислюються і виводяться значення функції на заданому інтервалі. 
    {
        double result = computeFunction(x);
        printf("%.2f\t\t%.4f\n", x, result);//Значення x та обчислене значення функції виводяться у вигляді форматованого рядка, використовуючи %f для відображення значень з плаваючою точкою.
    }

    return 0;
}
